IDEA Open Model
MatConcreteEc2.DiagramType Property
Compatible with IDEA StatiCa v 10.1
 Type of stress-strain diagram bilinear/parabolic/general for ULS calculation
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public ConcDiagramType DiagramType { get; set; }
Public Property DiagramType As ConcDiagramType
	Get
	Set
public:
property ConcDiagramType DiagramType {
	ConcDiagramType get ();
	void set (ConcDiagramType value);
}
Property Value
Type: ConcDiagramType
See Also
Reference
MatConcreteEc2 Class
IdeaRS.OpenModel.Material Namespace